Repository: P4suta/keep-pressing
Catalog: KeepPressing/Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp

# Status_Idle
source: Stopped
ja_jp: 停止中

# Status_Running
source: Running: {0}
ja_jp: 実行中: {0}

# Status_EmergencyHint
source: {0} (mash Esc for emergency stop)
ja_jp: {0}（Esc連打で緊急停止）

# Key_Unset
source: Not set
ja_jp: 未設定

# Toggle_Start
source: ▶ Start ({0})
ja_jp: ▶ 開始 ({0})

# Toggle_Stop
source: ■ Stop ({0})
ja_jp: ■ 停止 ({0})

# Cps_Format
source: ≈ {0}/sec
ja_jp: ≈ 毎秒 {0} 回

# Mouse_Left
source: Left click
ja_jp: 左クリック

# Mouse_Right
source: Right click
ja_jp: 右クリック

# Mouse_Middle
source: Middle click
ja_jp: 中クリック

# Mode_Repeat
source: Repeat
ja_jp: 連打

# Mode_Hold
source: Hold
ja_jp: 長押し

# Target_FixedPos
source: (fixed {0}, {1})
ja_jp: （固定 {0}, {1}）

# Target_CursorPos
source: (cursor position)
ja_jp: （カーソル位置）

# Target_Key
source: key {0}
ja_jp: キー {0}

# Mode_RepeatDesc
source: repeat {0} every {1}ms
ja_jp: {0} を {1}ms 間隔で連打

# Mode_HoldDesc
source: hold {0}
ja_jp: {0} を長押し

# Error_IntervalRequired
source: Enter the press interval.
ja_jp: 連打間隔を入力してください。

# Error_FixedPosRequired
source: Enter the fixed X / Y coordinates.
ja_jp: 固定座標の X / Y を入力してください。

# Error_KeyRequired
source: Set the key to press.
ja_jp: 連打するキーを設定してください。

# Error_HotkeyConflict
source: {0} couldn't be assigned because another app is using it.
ja_jp: {0} は他のアプリが使用中のため割り当てられませんでした。

# Error_RegisterFailed
source: Couldn't register {0} (another app is already using it).
ja_jp: {0} を登録できませんでした（他のアプリが使用中）。

# Error_Faulted
source: Stopped because an error occurred while sending input: {0}
ja_jp: 入力の送出中にエラーが発生したため停止しました: {0}

# HotkeyLabel.Text
source: Start/Stop hotkey
ja_jp: 開始/停止ホットキー

# HotkeySelector.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Start/stop hotkey
ja_jp: 開始停止ホットキー

# TargetSelector.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Press target
ja_jp: 連打の対象

# TargetMouse.Text
source: Mouse
ja_jp: マウス

# TargetMouse.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Mouse
ja_jp: マウス

# TargetKeyboard.Text
source: Keyboard
ja_jp: キーボード

# TargetKeyboard.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Keyboard
ja_jp: キーボード

# MouseButtonCard.Header
source: Button
ja_jp: ボタン

source: Mouse button
ja_jp: マウスボタン

# ClickPositionCard.Header
source: Click position
ja_jp: クリック位置

# UseFixedPosition.OnContent
source: Fixed coordinates
ja_jp: 固定座標

# UseFixedPosition.OffContent
source: Current cursor position
ja_jp: 現在のカーソル位置

# UseFixedPosition.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Click position
ja_jp: クリック位置

# FixedPositionCard.Header
source: Fixed coordinates
ja_jp: 固定座標

# FixedX.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: X coordinate
ja_jp: X 座標

# FixedY.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Y coordinate
ja_jp: Y 座標

# CapturePositionButton.Content
source: Pick on screen
ja_jp: 画面から取得

# CaptureInfo.Title
source: Capturing position
ja_jp: 座標キャプチャ中

# CaptureInfo.Message
source: Move the mouse to the target, then press F8 to confirm or Esc to cancel. (F8 and Esc are reserved by this app meanwhile.)
ja_jp: 目標へマウスを移動し、F8 で確定 / Esc で取消します（この間 F8 と Esc は本アプリが専有します）。

# CancelCaptureButton.Content
source: Cancel (Esc)
ja_jp: キャンセル (Esc)

# KeyCard.Header
source: Key
ja_jp: キー

# KeyCard.Description
source: Assign the key to press
ja_jp: 連打するキーを割り当てます

# ArmKeyCapture.Content
source: Set key
ja_jp: キーを設定

# ArmKeyCapture.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Set key
ja_jp: キーを設定

# KeyCaptureHint.Text
source: Press the key you want to assign.
ja_jp: このまま割り当てたいキーを押してください。

# ActionCard.Header
source: Action
ja_jp: モード

# ActionCard.Description
source: Repeat or hold
ja_jp: 連打 または 長押し

# ModeSelector.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Action mode
ja_jp: 動作モード

# IntervalCard.Header
source: Interval (ms)
ja_jp: 間隔 (ms)

# IntervalMs.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Press interval in milliseconds
ja_jp: 連打間隔ミリ秒

# Hint.Text
source: Tip: Hotkeys make starting and stopping easy. While running, you can also mash Esc for an emergency stop. If you start from this button in "current cursor position" mode, you'll end up pressing on this app itself.
ja_jp: ヒント: 開始/停止はホットキーが便利です。実行中は Esc連打でも緊急停止できます。「現在のカーソル位置」モードでこのボタンから開始すると、自アプリの上を連打することになります。
